
grade = int(input("Введите оценку от 2 до 5: "))

match grade:
    case 5:
        print("Результат: отлично")
        print("Это выдающиеся результаты.")
    case 4:
        print("Результат: хорошо")
        print("Это хороший результат.")
    case 3:
        print("Результат: удовлетворительно")
        print("Необходимо подучить материал.")
    case 2:
        print("Результат: неудовлетворительно")
        print("Требуется пересдача.")
    case _:
        print("Ошибка! Оценка должна быть от 2 до 5.")
